;Inno Setup XDELTA Patch Language file v1.3 for ISXPM 2.4.0.0
;Language: Polish
;Author: GPP <grajpopolsku@gmail.com>

[ISPATCH]
;Buttons
START_BUTTON='Start'
BROWSE_BUTTON='Przeglądaj'
INFO_BUTTON='Informacje'
EXIT_BUTTON='Wyjście'
BACKUP_BUTTON='Zapisz kopię'
LOG_BUTTON='Zapisz log'
MUSIC_BUTTON_PLAY='Muzyka'
MUSIC_BUTTON_PAUSE='Muzyka'
VERIFY_BUTTON='Weryfikuj sumy kontrolne'
CLOSE_BUTTON='Zamknij'

;Logs
ROLLBACK_STARTED='Przywracanie plików rozpoczęte!'
ROLLBACK_END='Wystąpił błąd. Przywrócono wszystkie zmienione pliki.'

FAILED_TO_ROLLBACK='[!]  Błąd: Nie udało się przywrócić z: '
FAILED_TO_ROLLBACK2=' pliku do: '


ROLLBACK_SUCCESS2=' do: '
ROLLBACK_SUCCESS3=' zakończone powodzeniem.'

FAILED_TO_DELETE_INCLUDED='[!]  Błąd: Nie udało się usunąć załączników: '

INCLUDED_DELETED_SUCCESS2=' usunięto pomyślnie.'

INCLUDED_DIR_DELETED2=' jest pusty i został usunięty.'

BACKUP_DIR_DELETED2=' został usunięty.'

BACKUP_DIR_DELETED_NOT_FULLY2=' został wyczyszczony, ale części plików i/lub folderów nie można było usunąć.'

ROLLBACK_FINISHED='Przywracanie zakończone!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Instalacja zakończona z błędami!'

EXTRACT_TEMP_PATCH_DATA='Wypakowywanie danych różnicowych do katalogu tymczasowego...'

START_PATCHING='[Instalacja rozpoczęta]'

TARGET_FILE='--> Plik źródłowy: '
PATCH_DATA_FILE='=> Plik różnicowy: '
OUTPUT_PATCHED='>> Plik docelowy: '

ERROR_DELETING_OLD_FILE='[!]  Wystąpił błąd podczas kasowania oryginalnego pliku! Możliwe, że jest używany przez inny program!'

NOT_EXISTS_OR_MISSMATCH='[!]  Błąd: W wybranym katalogu nie istnieją wymagane pliki do modyfikacji lub ich sumy kontrolne nie zgadzają się z oczekiwanymi.'
CORRECT_PROBLEM='[!]  Usuń problem i uruchom ponownie instalację.'

PATCHING_END='[Instalacja zakończona]'
COPYING_START='[Rozpoczęto kopiowanie]'

COPY_FAILED='[!]  Błąd: Nie można skopiować pliku: '
COPY_FAILED2=' do:'

COPY_IN_USE='Być może '
COPY_IN_USE2=' jest używany!'

INCLUDED_COPYIED2=' skopiowano do: '

COPYING_END='[Kopiowanie zakończone]'

TEMP_ROLLBACK_DELETED_IN_USE2=' został wyczyszczony, ale części plików i/lub folderów nie można było usunąć.'

EXTERNAL_COPYIED='Dodatkowe pliki zostały skopiowane do: '

STORED_BACKUP='Kopia plików została zapisana w katalogu: '

OPERATION_SUCCESS='Operacja zakończyła się powodzeniem!'

;Checks
FIND_BY_WINDOW_NAME='Aplikacja docelowa jest uruchomiona!'
FIND_BY_WINDOW_NAME2='Zamknij aplikację '
FIND_BY_WINDOW_NAME3=' i uruchom ponownie program instalacyjny łatki!'

FIND_BY_CLASS_NAME='Aplikacja docelowa jest uruchomiona!'
FIND_BY_CLASS_NAME2='Zamknij aplikację '
FIND_BY_CLASS_NAME3=' i uruchom ponownie program instalacyjny łatki!'

FIND_BY_MUTEX='Aplikacja docelowa jest uruchomiona!'
FIND_BY_MUTEX2='Zamknij aplikację '
FIND_BY_MUTEX3=' i uruchom ponownie program instalacyjny łatki!'

FIND_BY_PROC='Aplikacja docelowa jest uruchomiona!'
FIND_BY_PROC2='Zamknij '
FIND_BY_PROC3=' i uruchom ponownie program instalacyjny łatki!'

;Errors
ORIGINAL_NOT_FOUND='Nie znaleziono aplikacji w wybranym folderze!'

ROLLBACK_ERROR='Wystąpił błąd podczas instalacji. Instalator przywraca poprzednie wersje plików.'
ROLLBACK_ERROR2='Zakończono przywracanie zmodyfikowanych plików. Dodatkowe pliki zostały usunięte.'
ROLLBACK_ERROR3='Usunąć katalog z kopią: '
ROLLBACK_ERROR4='razem ze wszystkimi zawartymi w nim plikami i podkatalogami?'

INCORRECR_PATH_ENTERED='Niepoprawna ścieżka! Proszę wybrać folder instalacyjny aplikacji!'

NOTHING_TO_PATCH='Błąd! W wybranym folderze brakuje plików wymaganych do modyfikacji!'
NOTHING_TO_PATCH2='Proszę sprawdzić czy oryginalne pliki znajdują się w folderze docelowym!'
NOTHING_TO_PATCH3='Brak plików do modyfikacji!'
FINISHED_WITH_ERRORS='Instalacja zakończyła się błędem! Sprawdź log instalacyjny!'
PATCH_UNSUCCESS='[!]  Wystąpił błąd podczas instalacji!'

;Informations
BROWSE_DIALOG='Proszę wybrać ścieżkę do folderu instalacyjnego aplikacji:'

PATCHING_PROCESS='Proszę czekać, trwa instalacja...'
PATCH_APPLIED='Instalacja zakończona!'
PATCHING='Modyfikuję: '
PATCHING_ERROR='Nie zmodyfikowano plików!'
PATCHING_PREPARING='Rozpoczynam instalację...'
COPYING_PROCESS='Proszę czekać, trwa kopiowanie...'
COPYING_EXTERNAL='Kopiowanie dodatkowych plików...'
FORM_CLOSED='Okno z programem instalacyjnym zamknie się automatycznie za '
FORM_CLOSED2=' sekund.'

;new 0.8
DELETING_JUNKED='[Usuwanie niepotrzebnych plików rozpoczęte]'
COMPLETING_JUNKED='[Usuwanie niepotrzebnych plików zakończone]'
JUNKED_REMOVED='--> Usuwam plik przeznaczony do usunięcia: '
JUNKED_REM_FAILED='[!]  Błąd w trakcie usuwania pliku przeznaczonego do usunięcia: '
FAILED_TO_RESTORE='[!]  Błąd: Nie można przywrócić pliku przeznaczonego do usunięcia z: '
FAILED_TO_RESTORE2=' do: '
JUNKED_RESTORED='Plik przeznaczony do usunięcia: '
JUNKED_RESTORED2=' został przywrócony.'

;new 0.9
;ALLREADY_UPDATED='Aplikacja została już zmodyfikowana!'


; Language update 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='Niezgodność sumy kontrolnej pliku!'
INCORRECT_HASH2='Proszę sprawdzić wersję aplikacji!'
INVALID_HASH='[!]  Błąd! Nieprawidłowa suma kontrolna dla pliku: '
VALID_HASH='Poprawna suma kontrolna dla pliku: '

SET_ATTRIBUTES='Ustawianie atrybutów plików...'
SET_ATTRIBUTES_FAILED='[!]  Nie udało się ustawić oryginalnych atrybutów dla pliku: '
SET_ATTRIBUTES_SUCCESS='Atrybuty plików zostały ustawione pomyślnie!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Część atrybutów nie została ustawiona pomyślnie!'

HANDLE_ERROR='[!]  Wystąpił krytyczny błąd podczas uzyskiwania dostępu do: '

GET_TIME_FAILED='[!]  Nie udało się pobrać atrybutów czasu z pliku: '
SET_TIME_FAILED='[!]  Nie udało się ustawić atrybutów czasu dla pliku: '

VERIFICATION_START='Rozpoczęcie procesu weryfikacji...'
VERIFICATION_FINISH='Proces weryfikacji zakończony! Nie wykryto niezgodności sum kontrolnych!'

PREPARING_TO_OPERATIONS='Przygotowanie do kolejnych operacji, czekanie na zakończenie pracy silnika łatek różnicowych...'

FORCE_PATCHING='Łatanie w trybie wymuszonym!'
FORCE_PATCHING2='Tylko istniejące wymagane pliki zostaną zaktualizowane, wszystko inne zostanie pominięte...'

COPYING_EXTERNAL_FILE='--> Kopiowanie pliku do: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Wystąpił błąd podczas kopiowania pliku: '

EXTRACTING_PROCESS='Wypakowywanie dodatkowych danych...'
EXTRACTING_EXTERNAL_FILE='--> Wypakowywanie danych do: '
EXTERNAL_EXTRACTED='Dodatkowe dane zostały wypakowane do: '
EXTRACTING_START='Proszę czekać, trwa wypakowywanie...'

EXTRACTING_ERROR='[!]  Dekompresja nie powiodła się. Być może archiwum jest uszkodzone lub jest zbyt mało wolnego miejsca!'
EXTRACTING_ERROR2='Wypakowywanie archiwum nie powiodło się!'
EXTRACTING_ERROR3='Być może archiwum jest uszkodzone lub jest zbyt mało wolnego miejsca!'
EXTRACTING_WITH_ERRORS='Wypakowywanie archiwum zakończyło się z błędami! Sprawdź log instalacyjny!'

DOWNLOAD_REQUIRED='Ta łatka wymaga pobrania części danych z serwera!'
DOWNLOAD_FAILED='[!]  Nie można kontynuować procesu łatania bez wymaganych danych!'
DOWNLOAD_FAILED2='Proszę zapewnić dostęp do połączenia z serwerem i spróbować ponownie!'

DOWNLOAD_MIRROR='Nie udało się pobrać danych z głównego serwera. Podejmuję próbę pobierania danych z serwera lustrzanego...'
DOWNLOAD_START='Pobieranie danych: '
DOWNLOAD_START2='Do: '
DOWNLOAD_START3='Całkowity rozmiar: '

READ_OK='Dane pobrane pomyślnie!'
CONNECT_ERROR_NETWORK='[!]  Błąd: Brak połączenia z Internetem lub połączenie internetowe nie jest aktywne.'
CONNECT_ERROR_OFFLINE='[!]  Błąd: Komputer jest w trybie offline.'
CONNECT_ERROR_INITIALIZE='[!]  Błąd: Nie udało się zainicjować pakietowi instalacyjnemu uzyskania dostępu do Internetu.'
CONNECT_ERROR_OPENSESSION='[!]  Błąd: Nie udało się otworzyć sesji FTP lub HTTP.'
CONNECT_ERROR_CREATEREQUEST='[!]  Błąd: Nie udało się utworzyć uchwytu żądania HTTP.'
CONNECT_ERROR_SENDREQUEST='[!]  Błąd: Nie udało się wysłać żądania do serwera HTTP.'
READ_ERROR_DELETEFILE='[!]  Błąd: Plik lokalny istnieje, ale nie udało się go usunąć.'
READ_ERROR_SAVEFILE='[!]  Błąd: Nie udało się zapisać danych do pliku lokalnego.'
READ_ERROR_CANCELED='[!]  Błąd: Pobieranie przerwane przez użytkownika.'
READ_ERROR_READDATA='[!]  Błąd: Nie udało się odczytać danych ze zdalnego adresu URL.'
UNKNOWN_ERROR='[!]  Nieznany błąd: Kod statusu HTTP to: '

CANCEL_DOWNLOAD_BUTTON='Anuluj pobieranie'

;old corrected
TOTAL_PATCHED_FILES='Całkowita liczba przetworzonych plików: '
PATCHING_LOG='Log z instalacji zapisano do: '
INCLUDED_COPYIED='--> Załącznik: '
TEMP_ROLLBACK_DELETED='Tymczasowe pliki do przywracania zostały skasowane w: '
DIRECT_PATCH_DATA='Bezpośredni dostęp do danych różnicowych...'

;Strings
DESCRIPTION='Opis:'
COPYRIGHT='Prawa autorskie:'
CONTACT='Kontakt:'
INSTALLATION='Folder docelowy:'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='Błędna suma kontrolna MD5 w oryginalnym pliku!'
;INCORRECT_MD52='Proszę sprawdzić wersję aplikacji!'
;INVALID_HASH='[!]  Nieprawidłowa suma kontrolna MD5 dla zaktualizowanego pliku: '
;VALID_HASH='Poprawna suma kontrolna MD5 dla zaktualizowanego pliku: '
;TEMP_ROLLBACK_DELETED2=' zostały skasowane.'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='Łatka do'
FOUNDED_VERSION='Wykryto: '
VERSION_TO_PATCH='Przygotowanie do łatania: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Proszę wybrać folder instalacyjny aplikacji!'

ALLREADY_UPDATED='Aplikacja w tym katalogu została już zaktualizowana!'
ROLLBACK_SUCCESS='Przywracanie: '
INCLUDED_DIR_DELETED='Katalog z załącznikami: '
INCLUDED_DELETED_SUCCESS='Załącznik: '
BACKUP_DIR_DELETED='Katalog z kopią: '
BACKUP_DIR_DELETED_NOT_FULLY='Katalog z kopią: '
TEMP_ROLLBACK_DELETED_IN_USE='Tymczasowy katalog do przywracania: '

; Language update 1.0 for ISXPM 2.0.0.0 
EXTRACT_TO_TEMP='Wypakowywanie wymaganych tymczasowych danych...'
EXTRACT_TO_TEMP2='Proszę czekać, trwa wypakowywanie...'
FOUNDED_VERSION_READY='Gotowe do łatania!'
FILE_NOT_EXISTS='[!]  Wymagany plik do łatania nie istnieje: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Nie znaleziono aplikacji w wybranym folderze!'
FOUNDED_VERSION2='Wykryto prawidłową wersję! Gotowe do łatania!'
VERIFICATION_UNSUCCESS='[!]  Niektóre pliki nie istnieją lub mają nieprawidłową sumę kontrolną!'
UNKNOWN_PATCHING_ERROR='[!]  Wystąpił błąd podczas nakładania danych różnicowych na: '

; Language update 1.1 for ISXPM 2.2.0.0 
LOG_BTN_STATE='Log'

S_PATCHING='--> Łatanie pliku: '
S_COPYING='--> Kopiowanie pliku: '
S_EXTRACTING='--> Wypakowywanie pliku: '
S_COPYING_EXTERNAL='--> Kopiowanie dodatkowego pliku: '
S_ROLLBACK='--> Przywracanie pliku: '
S_DELETING='--> Usuwanie pliku: '
S_JUNKED_RESTORED='--> Przywracanie pliku przeznaczonego do usunięcia: '
S_INVALID_FILE='[!]  Nieprawidłowy plik: '
S_VALID_FILE='OK! Prawidłowy plik: '

; Language update 1.2 for ISXPM 2.3.0.0 
VERSION_DETECTING='Wykrywanie wersji... Proszę czekać...'

; Language update 1.2.1 for ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  Następujący plik nie istnieje więc został pominięty: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Za mało wolnego miejsca na '
REQUIRED_SPACE='Wymagana przestrzeń do pomyślnej instalacji wynosi '
SPACE_GB='GB!'
SPACE_MB='MB!'
SPACE_ONLY='Jest tylko '
SPACE_GB_FREE='GB wolnego miejsca na woluminie '
SPACE_MB_FREE='MB wolnego miejsca na woluminie '
SPACE_FREE_ONLY='Wolne miejsce wynosi tylko '

;old corrected:
INSTALL_PATH_NOT_FOUND='Nie znaleziono oczekiwanej wersji aplikacji w wybranym folderze!'


